#დაწერე პროგრამა, რომელიც ამოწმებს, არის თუ არა მომხმარებლის შემოტანილი  რიცხვი 10-ზე ნაკლები.
num1 = int(input("Enter number: "))

print(num1 < 10)

#მომხმარებელს შემოტანინეთ რიცხვი და შეამოწმეთ არის თუ არა შემოტანილი რიცხვი ლუწი

num1 = int(input("Enter number: "))

print(num1 % 2)

#შეამოწმე, არის თუ არა მომხმარებლის რიცხვი დადებითი.

num1 = int(input("Enter number: "))

print(num1 >= 0)

#შეამოწმე, არის თუ არა მომხმარებლის შემოტანილი ორი რიცხვი ტოლი.


num1 = int(input("Enter number: "))
num2 = int(input("Enter number: "))

print(num1 == num2 )

#დაწერე პროგრამა, რომელიც ამოწმებს, არის თუ არა მომხმარებლის შემოტანილი რიცხვი 100-ზე მეტი და ლუწი.
num1 = int(input("Enter number: "))

print( (num1 > 100) % 2)


#შეამოწმე მომხმარებლის შემოტანილი რიცხვი თუ არის 5-ის ან 10-ის ჯერადი.

num1 = int(input("Enter number: "))

print(num1 / 5)


#დაწერე პროგრამა, რომელიც ამოწმებს, არის თუ არა მომხმარებლის რიცხვი 0-ზე ნაკლები.
num1 = int(input("Enter number: "))

print(num1 < 0 )

#შეამოწმე, არის თუ არა ციფრი მთელი რიცხვი.
num1 = int(input("Enter number: "))

print(num1 )


#მომხმარებელს შემოატანინეთ მისი ასაკი და შეამოწმეთ არის თუ არა სრულწლოვანი 
age = int(input("Enter your age: "))

print(age > 18)


#დაწერე პროგრამა, რომელიც ამოწმებს, არის თუ არა რიცხვი ლუწი ან 3-ის ჯერადი.
num1 = int(input("Enter number: "))

print( (num1 % 2) * 3)


#შემოატანინეთ მომხმარებელს რიცხვი და შეამოწმეთ , არის თუ არა რიცხვი 1-ის ან 0-ის ტოლი.
num1 = int(input("Enter number: "))

print( (num1 >= 0) (num1 >= 1))


#შეამოწმე, არის თუ არა მომხმარებლის შემოტანილი ორი რიცხვი ერთმანეთზე მეტი და 10-ის ჯერადი.
num1 = int(input("Enter number: "))
num2 = int(input("Enter number: "))

print(num1 > num2 )
print(num1 * 10)
print(num2 * 10)

#დაწერე პროგრამა, რომელიც ამოწმებს, არის თუ არა რიცხვი უარყოფითი ან  ლუწი.
num1 = int(input("Enter number: "))

print((num1 > 0) % 2)

#მომხმარებლის შემოტანილი რიცხვი შეამოწმე, არის თუ არა  20-ის ჯერადი და დადებითი.
num1 = int(input("Enter number: "))

print( (num1 * 20)  > 0)

#დაწერე პროგრამა, რომელიც ამოწმებს, არის თუ არა რიცხვი ერთდროულად 50-ზე ნაკლები და 10-ის ჯერადი.
num1 = int(input("Enter number: "))

print( (num1 < 50) * 10)



