#1) შექმინთ 2 სია  , პირველი სია ინქება ცარიელი  ხოლო მეროე სია ინქება სახელებით სავსე მინიმუმ 5 , თქვენი დავალებაა ამ სიიდან  ჩაამოტომ მეორე სიაში სახელელბი რომელიც  4 სიმბოლოზე ნაკლებია
stri = []
stri1 = ["Luka", "Gio" , "Davit" , "Saba", "Ilia", "Zuka" ,"Giga", "Berdia", "Daniel" "David" ]

for i in stri1:
    if len(i) < 4:
        stri.append(i)
print(stri)


#2) უყურეთ ჩანაწერს თავიდან და გაიაზრეთ ახალი მასალია
print("Done!")



#3 ) გააკეთეთ სია სადაც იქნება 10 ინტეჯერი , ინტეჯერები რომელიბ იქნება 10 ზე ნაკლები append ის დახმარებით შეიყვანეთ ახალ ცხრილში
num = []
num1 = [1,2,3,4,5,6,7,8,9,10]

for i in num1:
    if i < 10:
        num.append(i)
print(num)


#4) შექმენით 3 ცრილი სამივე იქნება განსხვავებული მონაცემთა ტიპიები  | ბოლეანი არა საჭირო | და შექმენით ცარიელი ცხრილი სადაც იქნება დასაწყისში ინტეჯერების ცხრილი  სტრინგების ცხრილი და მერე ფლოათების ცხრილი
stri2 = ["Luka", "Laghoshvili"]
num2 = [1,2,3,4,5]
num3 = [1.3,1.6,2.5,5.5]
num4 = []

for x in stri2:
    num4.append(x)

for i in num2:
    num4.append(i)

for y in num3:
    num4.append(y)

print(num4)
