#1) შექმენით კალკულატორი, მომხმარებელს შეეკითხეთ ორი რიცხვი, შემდეგ შეეკითხეთ რა მოქმედების შესრულება სურს ამ ორ რიცხვზე და მისი პასუხიდან გამომდინარე შეასრულეთ მოქმედება და დაბეჭდეთ მაგალითად თუ მომხმარებელი შემოიტანს რიცხვებს 5 და 7 , და შემოიტანს მოქმედებას მაგალითად დამატებას თქვენ უნდა დაუბეჭდოთ 5 + 7 = 12

num1 = int(input("Enter first number: "))
num2 = int(input("Enter second number: "))
num0 = 0
sum = input("Enter + - / * ")

if sum =="+":
    num0 = num0 + num1 + num2
if sum == "-":
    num0 = num0 + num1 - num2
if sum == "/":
    num0 = num1 / num2
if sum == "*":
    num0 =  num1 * num2

print (num0)
