#1) for ციკლის მეშვეობით შეასრულეთ ყველა მათემატიკური ოპერაცია 0-დან 100-მდე რიცხვებზე 
for i in range(1,100):
    print(i+i)

for i in range(1,100):
    print(i-i)

for i in range(1,100):
    print(i * i)

for i in range(1,100):
    print(i/i)

#2) მომხმარებელს შემოატანინეთ რიცხვი და შემდეგ for loop - ის გამოყენებით გამოიტანეთ ამ რიცხვამდე ყველა რიცხვის ჯამი(მაგალითად თუ შეიყვანს 10ს გამოიტანეთ 10მდე ყველა რიცხვის ჯამი მაგალითად)
num1 = int(input("Enter number: "))
sum1 = 0
for i in range(1,num1):
    sum1 += i
print(sum1)



#3) მომხმარებელს შემოატანინეთ ორი რიცხვი ხოლო ამის შემდეგ for loop - ის გამოყენებით გამოიტანეთ ამ რიცხვებს შორის ჯამი და ნამრავლი.
num2 = int(input("Enter number: "))
num3 = int(input("Enter number: "))

numb1 = 0
numb2= 1

for i in range(num2 , num3):
    numb1 += i
    numb2 *= i
print(numb1)
print(numb2)




#4) დაწერეთ ალგორითმი, რომელიც მომხმარებელს შეეკითხება რიცხვს. თუ რიცხვი ლუწია გაყავით ორზე, სხვა შემთხვევაში გაამრავლეთ სამზე და მიუმატეთ ერთი.

num4 = int(input("Enter number: "))

if num4 % 2 == 0:
    print(num4 / 2)
else:
    print((num4 *3)+ 1)



#5) დაწერეთ პროგრამა რომელიც ბეჭდავს ყველა რიცხვს 1-100 მდე რომელიც იყოფა 3-ზე და 5-ზე

for i in range (1, 100):
    if i % 3 == 0:
        print(i)
    if i % 5 == 0:
        print(i)



#1) დაიწყეთ 10-დან და დაითვალეთ 1-მდე, დაბეჭდეთ თითოეული რიცხვი.

numb3 = 10
while numb3 > 0:
    print(numb3)
    numb3 -= 1




#2) განუწყვეტლივ სთხოვეთ მომხმარებელს მისი სახელი, სანამ არ შეიყვანს "quit"-ს.
name = "quit"
name_guess = input("Enter name: ")

while name_guess != name:
    name_guess = input("Enter name: !")





#3) ამობეჭდეთ ყველა ლუწი რიცხვი 10-დან 20-მდე while ციკლის გამოყენებით.

numb4 = 10
while numb4 % 2 == 0:
    while numb4 < 21:
        print(numb4)
        numb4 += 2



#4) მომხმარებელს შეაყვანინეთ რიცხვი და განაგრძეთ კითხვა მანამ, სანამ არ შეიტანს დადებით რიცხვს.
num1 = int(input("Enter positive number: "))

while num1 >= 0:
    print("This number is positive ")
    break
while num1 < 0:
        print("This number is negative ")
        num1 = int(input("Enter positive number: "))



#5) 1-იდან 10-ის ჩათვლით არსებული ყველა რიცხვის კვადრატი გამოიტანეთ while ციკლის გამოყენებით.

numb6 = 10
while numb6 > 1:
    print(numb6 ** 2)
    numb6 -= 1


#1) შექმენით სია რომელშიც გექნებათ 1 დან 20-მდე რიცხვები დაბეჭდეთ თითოეული სიის ელემენტი და თითოეულ მათგანს მიუწერეთ ლუწია თუ კენტი, გამოიყენეთ for loop

list1 = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]

for i in list1:
    print(i)
    if i % 2 ==0:
        print("This number is even")
    else:
        print("This number is odd")


#2) შექმენით სია რომელშიც გექნებათ 1 დან 20მდე რიცხვები შემდეგ კი დაბეჭდეთ 3 ის ჯერადი რიცხვები

list2 = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]

for i in list2:
    if i % 3 == 0:
        print(i)
        print("This number can devide by 3")


#3) შექმენით სია რომელშიც გექნებათ ათიცალი სხვადასხვა რიცხვი შემდეგ კი დაბეჭდეთ ამ სიიდან მხოლოდ 10ზე დაბალი რიცხვები გამოიყენეთ for loop
list3 = [10,23,154,34,123,12,3,534,63,756]
for i in list3:
    if i < 10:
            print(i)
            print("This number is lower than 10")


#4) შექმენით სია რომელშიც გექნებათ ოცი სხვადასხვა რიცხვი შემდეგ კი დაბეჭდეთ მხოლოდ 10-ზე ნაკლები და მხოლოდ ლუწი რიცხვები, ისე რომ ლუწიც იყოს და 10-ზე ნაკლებიც, გამოიყენეთ for loop
list4 = [10,23,154,34,123,12,3,534,63,756,29,2,4,6,22,20,59,11,8,66]

for i in list4:
    if i < 10:
        if i % 2 ==0:
            print(i)

#5) შექმენით სია რომელშიც გექნებათ ოცი სხვადასხვა რიცხვი შემდეგ კი დაბეჭდეთ მხოლოდ 20 ზე მეტი რიცხვები ისე რომ იყოს თან სამის ჯერადი გამოიყენეთ for loop

list5 = [10,23,154,34,123,12,3,534,63,756,29,2,4,6,22,20,59,11,8,66]
for i in list5:
    if i > 20:
        if i % 3 ==0:
            print(i)


#6) შექმენით სია სადაც მოათავსებთ ხუთ სხვადასხვა სახელს შემდეგ კი მიწვდით თითოეულ ელემენტს(სახელს) და დაბეჭდეთ თითოეულში ასოების რაოდენობა, გამოგადგებათ for loop და len ფუნქცია 
list6 = ["Luka" , "MARI" , "Gio" ,"Lali", "Davit"]
for i in list6:
    print(len(i))



# 7) შექმენით სია სადაც მოათავსებთ ხუთ სხვადასხვა სახელს შემდეგ კი დაბეჭდეთ ამ სიაში თითოეული ელემენტის პირველი ასო მხოლოდ გამოიყენეთ for loop

list7 = ["Luka" , "MARI" , "Gio" ,"Lali", "Davit"]
for i in list7:
    print(i[0])