# 1) ერთიდან 100 მდე დაბეჭდეთ ყველა რიცხვი while loop ის გამოყენებით
sum1 = 1
while sum1 < 100:
    print(sum1)
    sum1 += 1


#2) ერთიდან 100 მდე დაბეჭდეთ ყველა ლუწი რიცხვი while loop ის გამოყენებით if ების გარეშე
sum1 = 1
while sum1 < 100:
    print(sum1)
    sum1 += 2

#3) ერთიდან 100 მდე დაბეჭდეთ ყველა ლუწი რიცხვი while loop ის გამოყენებით if ების გამოყენებით
i = 1
while i < 100:
    if i % 2 == 0:
        print(i)
    i += 1

#  4) ერთიდან 100 მდე დაბეჭდეთ ყველა რიცხვი თან გვერძე მიუწერეთ ლუწია თუ კენტი  while loop ის გამოყენებით 
i1 = 1
while i1 < 100:
    if i1 % 2 == 0:
        print(i1, "Even")
    if 1 % 3 == 0:
        print(i1 , "Odd")
        


