#  1) შექმენით ფუნქცია რომელიც დახატავს კვადრატს და გამოიძახეთ ის რამდენჯერმე ასევე თვენი სიტყვებით აღწერეთ რა არის ფუნქცია როგორ გაიგეთ და რისთვის გვჭირდება კომენტარების სახით
from turtle import*
speed(120)
width(8)
color("Black")
penup()
goto (0,0)
pendown()


forward (100)
left(90)
forward(100)
left(90)
forward(100)
left(90)
forward(100)
left(90)
forward(100)


exitonclick()

#2) შექმენით რამდენიმე ფუნქცია სხვადასხვა მათემატიკური მოქმედებებისთვის ერთში, დაუმატეთ რიცხვები მეორეში გაამრავლეთ



#3) შექმენით ფუნქცია რომელშიც იქნება რიცხვებით სავსე სია ხოლო ფუნქცია დააბრუნებს ამ სიის ელემენტების ჯამს

def name(lst1):
    return sum (lst1)
print(name ([1,2,3,4,5,5,5,6,23,2,521,14,5,]))


#4) შექმენით ფუნქცია რომელსაც არგუმენტად გადავცემთ სახელს შემდეგ კი ის გვესალმება hello name, გამოიძახეთ ფუნქცია რამდენჯერმე და გადაეცით არგუმენტად სხვადასხვა სახელები

def name1(lst):
    return "Hello " + lst
print(name1 ("Luka"))
print(name1 ("Gio"))
print(name1 ("Goga"))
print(name1 ("Guram"))
print(name1 ("Lali"))
print(name1 ("Laura"))

