#1) შექმენით სია რომელშიც იქნება 15 ელემენტი შემდეგ გამოიტანეთ სიის ყველა ელემენტი while loop-ის გამოყენებით და ასევე for loop-ითაც
list1 = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]
for i in list1:
    print(i)







#2) მომხმარებელს შეეკითხეთ სახელი შემდეგ დაბეჭდეთ ამ სახელის მესამე ასო
name = input("Enter your name:")
print(name[2])


#3) შექმენით სია და for loop დახმარებით გამოიტანეთ მხოლოდ ლუწი ინდექსებზე მდგომი ელემენტები
list0 = 1
list1 = [1,2,3,4,5,6,7,8,9,10]
for i in list1:
    print(list1[list0])
    list0 += 2
    if list0 > len(list1):
        break


#4) შექმენით დიდი სია სადაც გექნებათ ბევრი ელემენტი და შემდეგ გამოიტანთ 5 ის ჯერად ინდექსებზე მდგომ ელემენტებს
num0 = 4
num = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]
for i in num:
    print(num[num0])
    num0 += 5
    if num0 >= len(num):
        break


#5) შექმენით სია სადაც გექნებათ  ყველა მონაცემთა ტიპის მქონე ელემენტები  შემდეგ for loop ით შეუმოწმებთ მონაცემთა ტიპებს და გამოიტანთ მხოლოდ სტრინგ ტიპის ელემენტებს

num2 = [1,2,3,4,1.5,2.5,5.5,"luka","lagoshvili"]
for i in num2:
    if type(i) == str:
        print(i)



#6) დაწერეთ პროგრამა რომელიც სიაში მყოფი ელემენტების ჯამს გამოითვლის 

num3 = [1,2,3,4,5,6,7,8,9,10,11]
print(sum(num3))


#7) შექმენით ახალი სია მხოლოდ ლუწი რიცხვების ერთი დიდი სიიდან 
num5 = []
num0 = 1
num4 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]
for i in num4:
    num5.append(num4[num0])
    num0 += 2
    if num0 >= len(num4):
        break
print(num5)


#8) გამოითვალეთ საშუალო არითმეტიკული რიცხვების სიიდან
num6 = [1,2,3,4,5,6,7,8,9]
num7 = (len(num6))
print(sum(num6) / num7)



#9) შექმენით ცვლადები და დააჯამეთ ლუწი და კენტი რიცხვები სიიდან 
num8 = [2,4,6,8,10,12,14,]
num9 = [1,3,5,7,9,11,13,15]
print(sum(num8))
print(sum(num9))



#10) დაითვალე დადებითი და უარყოფითი რიცხვების ჯამი სიიდან 
num11 = 0 
num12 = 0
num10 = [-1,-5,-10,10,20,22]
for i in num10:
    if i > 0:
        num11 += i
    else:
        num12 += i
print(num11)
print(num12)


